[
  {
    "path": "posts/2021-11-24-comparing-proteins/",
    "title": "Comparing Proteins",
    "description": "How to compare the proteins in diseases",
    "author": [],
    "date": "2021-11-24",
    "categories": [],
    "contents": "\r\nThe dataset that I got from NCBI has the mapped proteins for the associated SNPs, which makes this so much easier. I had to figure out how to write some code that would allow me to find the unique values of the mapped protein column in the dataset. For some reason it was harder for me than I anticipated. It was actually separating the different proteins out when there was more than one that the SNP was mapped to.\r\nAfter I got the unique values, I was able to compare the diseases to asthma, my disease in question. That was another hurtle I needed to jump with coding, but it wasn’t too bad. I created a different filter for each of the diseases being compared to asthma. After that I could compare which proteins were the same with some tables. I needed to figure out how to compare things that were different lengths. It took a little while to figure that out too. What I ended up doing was creating loop that appended lists with the genes that were effected in both the disease and in asthma.\r\n\r\n\r\n\r\nFigure 1: Result Chart\r\n\r\n\r\n\r\nI was shocked to find that the thyroid diseases were the ones that had the most proteins effected as asthma over some of the other diseases I was looking at. It was surprising because there are no related SNPs between the thyroid diseases and asthma.\r\nLearn more about using Distill at https://rstudio.github.io/distill.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-11-24-comparing-proteins/Protien_comparison_chart.png",
    "last_modified": "2021-11-27T22:40:41-07:00",
    "input_file": "comparing-proteins.knit.md"
  },
  {
    "path": "posts/2021-10-07-comparing-snps/",
    "title": "Comparing SNPs",
    "description": "How we compare SNPs",
    "author": [],
    "date": "2021-10-07",
    "categories": [],
    "contents": "\r\nI needed to narrow down which genetic diseases I was looking at because there are just so many. To choose them, I pulled some of the most common autoimmune diseases from the top 15. I really only used the ones I had heard of before and came out with 8 diseases to look at other than asthma.\r\nTo start, I used SNP data from GWAS studies and began finding similarities between asthma and other autoimmune diseases specifically. For each dataset of diseases, I needed to extract the needed information. In this case, it was the allele difference and the gene that the SNP came from. Afterward, I could make a Venn diagram to visualize the SNP locations that were the same in different diseases.\r\n\r\n\r\n\r\nFigure 1: Compare IBD, Graves, Celiac, Asthma\r\n\r\n\r\n\r\nLearn more about using Distill at https://rstudio.github.io/distill.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-10-07-comparing-snps/SNP_example_Venn_diagram.png",
    "last_modified": "2021-11-27T22:45:18-07:00",
    "input_file": "comparing-snps.knit.md"
  },
  {
    "path": "posts/2021-09-24-initial-post/",
    "title": "Initial Post",
    "description": "Propsal for senior project for fall 2021",
    "author": [],
    "date": "2021-09-24",
    "categories": [],
    "contents": "\r\nPersonal Background\r\nI took MATH 425 in Fall 2020 and MATH 450 in Winter 2021, but I am registered for MATH 488 this semester. I’m a biostatistics major, but I am more interested in the bioinformatics portion of it. By that I mean I want to help people by finding medicines that works for their biological conditions using the data in their DNA, but I have no concrete plans after graduation yet. My BYUI email is per16018@byui.edu.\r\nProject Background\r\nMany diseases have genetic markers that make people predisposed to them like asthma, diabetes, thyroid problems, and even skin things like eczema. These are actually all autoimmune diseases that I mentioned, which I spent a semester learning about a couple semesters ago in my bioinformatics class. I know there are some that have similar markers and if you have one illness, you can be more likely to have others. I have a lot of diseases that run in my family including asthma, arthritis, and Hashimoto’s thyroiditis. When there are more than one autoimmune diseases found in the same patient, it is called co-occurence and if there are at least 3 autoimmune diseases, it is called multiple autoimmune syndrome (MAS). I wanted to look at which ones were possibly connected.\r\nDomain to Investigate\r\nI will need to look at the research that has already been done about related diseases and also research diseases known to have genetic links in the first place. To find data for it, I would need to look at the NCBI database. Reading articles on the subject could also be beneficial.\r\nProposed Deliverables\r\nFind and clean datasets to use for comparisons\r\nLearn how to show the graphics for comparing genes and diseases in r\r\nUse statistical analysis to figure out if the differences are significant\r\nLearn more about using Distill at https://rstudio.github.io/distill.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-11-27T22:58:38-07:00",
    "input_file": "initial-post.knit.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome",
    "description": "Welcome to my blog for my Senior Project. I am very excited to be working with genetic data to find diseases that are related to one another. Please feel free to browse around and see what I'm up to!",
    "author": [],
    "date": "2021-09-20",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-11-27T15:03:15-07:00",
    "input_file": "welcome.knit.md"
  }
]
